In [ ]:
### concatenation, merge and joining Data frames in pandas

**Let us understand concatenation**

In [2]:
import pandas as pd
df1 = pd.DataFrame({'Item':['A','B','C','D'],
                    'Value':[1,2,3,5]})
df2 = pd.DataFrame({'Item':['E','F','G','H'],
                    'Value':[5,6,7,8]})
print(df1)
print(df2)

  Item  Value
0    A      1
1    B      2
2    C      3
3    D      5
  Item  Value
0    E      5
1    F      6
2    G      7
3    H      8

In [3]:
df1

  Item  Value
0    A      1
1    B      2
2    C      3
3    D      5

In [4]:
df2

  Item  Value
0    E      5
1    F      6
2    G      7
3    H      8

In [5]:
pd.concat([df1,df2])

  Item  Value
0    A      1
1    B      2
2    C      3
3    D      5
0    E      5
1    F      6
2    G      7
3    H      8

In [7]:
import pandas as pd
df1 = pd.DataFrame({'Item':['A','B','C','D'],
                    'Value':[1,2,3,5]})
df2 = pd.DataFrame({'Item':['E','F','G','H'],
                    'Quantity':[5,6,7,8]})
pd.concat([df1,df2])

  Item  Value  Quantity
0    A    1.0       NaN
1    B    2.0       NaN
2    C    3.0       NaN
3    D    5.0       NaN
0    E    NaN       5.0
1    F    NaN       6.0
2    G    NaN       7.0
3    H    NaN       8.0

In [8]:
import pandas as pd
df1 = pd.DataFrame({'Item':['A','B','C','D'],
                    'Value':[1,2,3,5]})
df2 = pd.DataFrame({'Item':['E','F','G','H'],
                    'Quantity':[6,7,8,9]})
pd.concat([df1,df2]).reset_index()

   index Item  Value  Quantity
0      0    A    1.0       NaN
1      1    B    2.0       NaN
2      2    C    3.0       NaN
3      3    D    5.0       NaN
4      0    E    NaN       6.0
5      1    F    NaN       7.0
6      2    G    NaN       8.0
7      3    H    NaN       9.0

In [9]:
pd.concat([df1,df2],axis=1)

  Item  Value Item  Quantity
0    A      1    E         6
1    B      2    F         7
2    C      3    G         8
3    D      5    H         9

**use append to add multiple dataframes to another**

In [11]:
import pandas as pd
df1 = pd.DataFrame({'Item':['A','B','C','D'],
                    'Value':[1,2,3,5]})
df2 = pd.DataFrame({'Item':['E','F','G','H'],
                    'Quantity':[6,7,8,9]})
df3 = pd.DataFrame({'Item':['I','J','K','L'],
                    'Quantity':[3,7,4,25]})

In [10]:
dfA = pd.DataFrame({'Key':['A','B','C','D'],
                    'A':[1,2,3,5]})
dfB = pd.DataFrame({'Key':['E','F','G','H'],
                    'B':[6,7,8,9]})
pd.merge(dfA,dfB, on='Key')

Empty DataFrame
Columns: [Key, A, B]
Index: []

In [12]:
dfA = pd.DataFrame({'Key':['K0','K1','K2','K3'],
                     'A': ['A0','A1','A2','A3'],
                     'B': ['B0','B1','B2','B3']})
dfB = pd.DataFrame({'Key':['K0','K1','K2','K3'],
                     'C': ['C0','C1','C2','C3'],
                     'D': ['D0','D1','D2','D3']})

pd.merge(dfA,dfB, on='Key')

  Key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [ ]:
joining

In [14]:
left = pd.DataFrame({'A':['K0','K1','K2','K3'],
                     'B': ['A0','A1','A2','A3']},
                    index = ['B0','B1','B2','B3'])

In [15]:
left

     A   B
B0  K0  A0
B1  K1  A1
B2  K2  A2
B3  K3  A3

In [16]:
right = pd.DataFrame({'A':['K0','K1','K2','K3'],
                     'B': ['A0','A1','A2','A3']},
                    index = ['B0','B1','B2','B3'])
right

     A   B
B0  K0  A0
B1  K1  A1
B2  K2  A2
B3  K3  A3

In [18]:
left = pd.DataFrame({'A':['K0','K1','K2','K3'],
                     'B': ['A0','A1','A2','A3']},
                    index = ['B0','B1','B2','B3'])
left

     A   B
B0  K0  A0
B1  K1  A1
B2  K2  A2
B3  K3  A3

In [19]:
left = pd.DataFrame({'A':['A0','A1','A2'],
                     'B': ['B0','B1','B2']},
                    index = ['K0','K1','K2'])
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [20]:
right = pd.DataFrame({'C':['C0','C1','C2'],
                     'D':['D0','D1','D2',]},
                      index = ['K0','K1','K2'])
right

     C   D
K0  C0  D0
K1  C1  D1
K2  C2  D2

In [21]:
left.join(right)

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2

In [22]:
left.join(right,how='outer')

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2

In [23]:
# Python program for finding H.C.F of two input numbers

def computeHCF(x,y):

# chosse the smaller number
    if x>y:
      smaller = y
    else:
      smaller = x
    for i in range(1, smaller+1):
       if ((x % i == 0) and (y % i == 0)):
         hcf =i

    return hcf

num1 = int(input("Enter first number"))
num2 = int(input("Enter second number"))

print("The H.C.F of",num1,"and",num2,"is", computeHCF(num1,num2))

Enter first number32
Enter second number56
The H.C.F of 32 and 56 is 8

In [24]:
# Python program for finding H.C.F of two input numbers

def computeHCF(x,y):

# chosse the smaller number
    if x>y:
      smaller = y
    else:
      smaller = x
    for i in range(1, smaller+1):
       if ((x % i == 0) and (y % i == 0)):
         hcf =i

    return hcf

num1 = int(input("Enter first number"))
num2 = int(input("Enter second number"))

print("The H.C.F of",num1,"and",num2,"is", computeHCF(num1,num2))

Enter first number56
Enter second number78
The H.C.F of 56 and 78 is 2

In [25]:
# Python program for finding H.C.F of two input numbers

def computeHCF(x,y):

# chosse the smaller number
    if x>y:
      smaller = y
    else:
      smaller = x
    for i in range(1, smaller+1):
       if ((x % i == 0) and (y % i == 0)):
         hcf =i

    return hcf

num1 = int(input("Enter first number"))
num2 = int(input("Enter second number"))

print("The H.C.F of",num1,"and",num2,"is", computeHCF(num1,num2))

Enter first number76
Enter second number78
The H.C.F of 76 and 78 is 2

## **phython Dictionaries**

In [26]:
thisdict = {
    "Brand": "Ford",
    "Model": "Mustang",
    "Year": 1984
}
print(thisdict)

{'Brand': 'Ford', 'Model': 'Mustang', 'Year': 1984}

In [27]:
thisdict = {
    "country":"india",
    "state":"karnataka",
    "year":2000
}
print(thisdict)

{'country': 'india', 'state': 'karnataka', 'year': 2000}

In [28]:
thisdict = {
    "Brand": "Ford",
    "Model": "Mustang",
    "Year": 1984,
    "country": "india"
}
print(thisdict)

{'Brand': 'Ford', 'Model': 'Mustang', 'Year': 1984, 'country': 'india'}

In [29]:
thisdict = {
    "Brand": "Ford",
    "Model": "Mustang",
    "Year": 1984,
    "country": "india"
}
print(thisdict["Brand"])

Ford

In [30]:
thisdict = {
    "Brand": "Ford",
    "Model": "Mustang",
    "Year": 1984,
     "country": "india"
}
print(thisdict["Year"])

1984

In [31]:
thisdict = {
    "Brand": "Ford",
    "Model": "Mustang",
    "Year": 1984,
     "country": "india",
     "Year": 2020
}
print(thisdict["Year"])

2020

In [32]:
print(len(thisdict))

4

In [33]:
thisdict = {
    "Brand": "Ford",
    "Model": "Mustang",
     "country": "india",
     "Year": 2020
}
print(thisdict["Year"])

2020

In [34]:
print(len(thisdict))

4

In [35]:
thisdict = {
    "Brand": "Ford",
    "Model": "Mustang",
     "country": "india"
}
print(thisdict["Model"])

Mustang

In [36]:
print(len(thisdict))

3

In [37]:
thisdict = {
    "Brand": "Ford",
    "Model": "Mustang",
     "country": "india",
     "Year":1978,
     "Colors":["red","white","blue"]
}
print(thisdict)    
print(type(thisdict))

{'Brand': 'Ford', 'Model': 'Mustang', 'country': 'india', 'Year': 1978, 'Colors': ['red', 'white', 'blue']}
<class 'dict'>

In [38]:
thisdict = {
    "Brand": "Ford",
    "Model": "Mustang",
     "country": "india",
     "Year":1978,
     "Colors":["red","white","blue"]
}
print(thisdict)

{'Brand': 'Ford', 'Model': 'Mustang', 'country': 'india', 'Year': 1978, 'Colors': ['red', 'white', 'blue']}